package ch6;

public class Exercise6_9 {

	/*6_9
	 * static int weapon = 6;
	 * static int armor = 0;
	 * static으로 선언해야 모든 병사의 공격력과 방어력이 같아진다.
	 * 추가 static 선언한 메서드도 static 메서드로 변경
	 */
	
	/*6_10
	 * b. 생성자는 객체 생성(new)과 초기화하는데 목적이 있다.
	 * c. 생성자는 오버로딩 할수 있다. 그렇기 때문에 여러 개의 생성자 생성가능
	 */
	
	/*6_11
	 * b. this는 인스턴스 메서드에서만 사용이 가능하다.
	 */
	
	/*6_12
	 * 리턴타입과 매개변수의 이름은 오버로딩에 영향을 주지 않는다.
	 */
	
	/*6_16
	 * 힙 영역 : 인스턴스 변수 생성
	 * 호출스택 : 지역변수 생성
	 */
	
	/*6_18
	 * 라인 A : 클래스 변수에는 인스턴스 변수로 초기화 x
	 * 라인 B : 클래스 메서드에서 인스턴스 변수 바로 사용 x
	 * 라인 D : 클래스 메서드에서 인스턴스 메서드 사용시 인스턴스 생성 필수
	 */
	
}
